Repository: IT22128140/AgroBuddy
Catalog: lib/l10n/app_*.arb
Languages: si

# app_title
source: AgroBuddy
si: ඇග්‍රොBuddy

# app_name
source: AgroBuddy
si: ඇග්‍රොBuddy

source: Records
si: වාර්තා

source: Forecast
si: අනාවැකි

source: Stock
si: තොග

# name_s
source: Name :
si: නම :

# age_s
source: Age :
si: වයස :

source: Name
si: නම

source: Age
si: වයස

source: Date
si: දිනය

source: Add
si: එකතු කරන්න

source: Delete
si: මකන්න

source: Edit
si: සංස්කරණය කරන්න

# scan
source: Scan QR
si: QR ස්කෑන් කරන්න

source: Animals
si: සතුන්

source: cattle
si: ගවයා

# chicken
source: Chiken
si: කුකුලා

source: Pigs
si: ඌරා

source: Goat
si: එලුවා

source: Buffalo
si: මී හරක්

source: Ducks
si: තාරාවන්

source: Bees
si: මී මැස්සන්

source: Other
si: වෙනත්

# harvest_m
source: Total harvest for the month:
si: මාසය සඳහා සම්පූර්ණ අස්වැන්න:

# qr_download
source: Download QR
si: QR බාගත කරන්න

source: Harvest
si: අස්වැන්න

# date_s
source: Date :
si: දිනය :

# quantity_s
source: Quantity :
si: ප්‍රමාණය :

# notes_s
source: Notes :
si: සටහන් :

source: Save
si: සුරකින්න

source: Quantity
si: ප්‍රමාණය

source: Notes
si: සටහන්

source: Cancel
si: අවලංගු කරන්න

source: Error
si: දෝෂයක්

source: No data
si: දත්ත නොමැත

# birthday
source: Birtday
si: උපන්දිනය

source: Years
si: වසර

source: Months
si: මාස

source: and
si: සහ

source: View
si: නරඹන්න

source: Upload Image
si: පින්තූරය උඩුගත කරන්න

# err_name
source: Please enter a name
si: කරුණාකර නමක් ඇතුළත් කරන්න

# err_type
source: Please select a type
si: කරුණාකර වර්ගයක් තෝරන්න

# err_birthday
source: Please enter a birthday
si: උපන්දිනය ඇතුළත් කරන්න

# err_animalimage
source: Please upload an image
si: පින්තූරය උඩුගත කරන්න

# err_notes
source: Please enter notes
si: කරුණාකර සටහන් ඇතුළත් කරන්න

# err_quantity
source: Please enter a quantity
si: කරුණාකර ප්‍රමාණය ඇතුළත් කරන්න

# err_date
source: Please enter a date
si: කරුණාකර දිනය ඇතුළත් කරන්න

# confirm_delete
source: Are you sure you want to delete this record?
si: ඔබට මෙම වාර්තාව මැකීමට අවශ්‍ය බව විශ්වාසද?

# delete_confirmation
source: You cannot undo this action
si: ඔබට මෙම ක්‍රියාව පසුගමනය කළ නොහැක

# login_name
source: Hello Sign In!
si: ආයුබෝවන් පුරන්න

# email_input
source: Email
si: විද්‍යුත් තැපෑල

# pw_input
source: Password
si: මුරපදය

# forgotpw_input
source: Forgot Password?
si: මුරපදය අමතක ද?

# signin_btn
source: SIGN IN
si: පුරන්න

# no_acc
source: Don’t have an Account?
si: මා හට ගිණුමක් නැත?

# signup_btn
source: SIGN UP
si: ලියාපදිංචි වන්න

# pw_mismatch
source: Password doesn’t match!
si: මුරපද එකිනෙකට නොගැලපේ!

# signup_text
source: Create Your Account
si: ඔබේ ගිණුම නිර්මාණය කරන්න

# username_input
source: User Name
si: පරිශීලක නාමය

# conpw_input
source: Confirm Password
si: මුරපදය තහවුරු කරන්න

# yes_acc
source: Already have an Account?
si: දැනටමත් ගිණුමක් ඇත?

# harvest_imp
source: Important
si: වැදගත්

# harvest_imp_text
source: The forecast yield may vary due to technological, biological and environmental factors.
si: තාක්ෂණික, ජීව විද්‍යාත්මක සහ පාරිසරික සාධක හේතුවෙන් පුරෝකථනය කරන ලද අස්වැන්න වෙනස් විය හැක.

# st_yield
source: Standard Yield (kg per ac)
si: සම්මත අස්වැන්න (අක්කරයට කිලෝ ග්‍රෑම්)

# cult_area
source: Cultivated Land Extent (ac)
si: වගා බිම් ප්‍රමාණය (අක්කර)

# last_yield
source: Last Time Yield (kg per ac)
si: පසුගිය සමයේ අස්වැන්න (අක්කරයට කිලෝ ග්‍රෑම්)

# cast_harv
source: Forecasted Harvest
si: පුරෝකථනය කරන ලද අස්වැන්න

# amount_kg
source: kg
si: කිලෝ ග්‍රෑම්

# calc_btn
source: Calculate
si: ගණනය කරන්න

# logout_btn
source: Logout
si: පිටවීම

source: Income
si: ආදායම

source: Expense
si: වියදම

# acc_t_err
source: Please select an account type
si: කරුණාකර ගිණුම් වර්ගයක් තෝරන්න

# acc_t
source: Select Account type
si: ගිණුම් වර්ගය තෝරන්න

# acc_t_cash
source: Cash
si: මුදල්

# acc_t_bank
source: Bank Card
si: බැංකු කාඩ්පත

# acc_t_loan
source: Loan
si: ණය

# cate_err
source: Please select a category type
si: කරුණාකර කාණ්ඩයක් තෝරන්න

# cate
source: Select Category
si: කාණ්ඩය තෝරන්න

# cate_capital
source: Capital
si: ප්‍රාග්ධනය

# cate_harvest
source: Harvest
si: අස්වැන්න

# cate_eggs
source: Eggs
si: බිත්තර

# cate_milk
source: Milk
si: කිරි

# cate_meat
source: Meat
si: මස්

# cate_honey
source: Honey
si: මී පැණි

# cate_seeds
source: Seeds
si: බීජ

# cate_fertilizer
source: Fertilizer
si: පොහොර

# cate_pesticide
source: Pesticide
si: කෘමි නාශක

# cate_animalfeed
source: Animal Feed
si: සත්ව ආහාර

# cate_vetdrugs
source: Veterinary Drugs
si: පශු ඖශධ

# cate_labor
source: Labor
si: ශ්‍රමය

# cate_machine
source: Machine Repair
si: යන්ත්‍ර අළුත්වැඩියා

# cate_rent
source: Rent
si: කුලිය

# amount_err
source: Please add an amount
si: කරුණාකර මුදල ඇතුළත් කරන්න

# amount
source: Add Amount (Rs.)
si: මුදල ඇතුළත් කරන්න (රු.)

# sel_date_err
source: Please select a date
si: කරුණාකර දිනයක් තෝරන්න

# sel_date
source: Select Date
si: දිනය තෝරන්න

# sel_time_err
source: Please select a time
si: කරුණාකර කාලයක් තෝරන්න

# sel_time
source: Select Time
si: කාලය තෝරන්න

source: Add Notes
si: සටහනක් යොදන්න

# sel_type_err
source: Please Select a Type
si: කරුණාකර වර්ගයක් තෝරන්න

# sel_type
source: Select Type
si: වර්ගය තෝරන්න

# total_s
source: Total :
si: එකතුව :

source: Rs.
si: රු.

# show_ill
source: Show Illustrations
si: රූප සටහන් පෙන්වන්න

# sel_trange
source: Select Time Range
si: කාල පරාසය තෝරන්න

# sel_trange_err
source: Please select a time range
si: කරුණාකර කාල පරාසයක් තෝරන්න

# tr_year
source: Yearly
si: වාර්ෂිකව

# tr_month
source: Monthly
si: මාසිකව

# tr_sixm
source: 6 Months
si: මාස 6 ක්

source: January
si: ජනවාරි

source: February
si: පෙබරවාරි

source: March
si: මාර්තු

source: April
si: අප්‍රේල්

source: May
si: මැයි

source: June
si: ජූනි

source: July
si: ජූලි

source: August
si: අගෝස්තු

source: September
si: සැප්තැම්බර්

source: October
si: ඔක්තෝබර්

source: November
si: නොවැම්බර්

source: December
si: දෙසැම්බර්

# date_rv
source: Date
si: දිනය

# time_rv
source: Time
si: වේලාව

# type_rv
source: Type
si: වර්ගය

# account_rv
source: Account Type
si: ගිණුම් වර්ගය

# category_rv
source: Category
si: කාණ්ඩය

# amount_rv
source: Amount
si: මුදල

# note_rv
source: Note
si: සටහන්

# jan_jun
source: January - June
si: ජනවාරි - ජූනි

# jul_dec
source: July - December
si: ජූලි - දෙසැම්බර්

# pw_reset_suc
source: Email Sent to Reset Password
si: විද්‍යුත් තැපෑල පිරික්සන්න

# pw_reset_err
source: Invalid Email
si: නිවැරදි විද්‍යුත් තැපෑල ඇතුලත් කරන්න

source: Type
si: වර්ගය

source: Purchased Date
si: මිලදී ගත් දිනය

source: Exp Date
si: කල් ඉකුත් වන දිනය

# purchasedPrice
source: Price
si: මිල

source: Supplier
si: සැපයුම්කරු

source: Additional Notes
si: අමතර සටහන්

source: Stock ID
si: තොග හැඳුනුම

# stockName
source: Name
si: නම

# noData
source: No Stock Available
si: තොග නොමැත

# confirmDelete
source: Are you sure you want to delete this record?
si: ඔබට මෙම වාර්තාව මැකීමට අවශ්‍ය බව විශ්වාසද?

# deleteConfirmationMessage
source: You cannot undo this action.
si: ඔබට මෙම ක්‍රියාව පසුගමනය කළ නොහැක.

# expThisWeek
source: Expiring This Week
si: මෙම සතියේ කල් ඉකුත් වේ

# expNextMonth
source: Expiring Next Month
si: ලබන මස කල් ඉකුත් වේ
